# Gather Section (20 Questions, 40 Marks)

You should have access to a file called TMDB.db. The first step to answering this set of questions will be to connect to this db file to access the data. 

![SQL Architectures](https://raw.githubusercontent.com/Explore-AI/Public-Data/master/image/TMDB_ERD.JPG)

Before we start we need to load our SQL magic commands (we only need do this once per notebook):

In [3]:
%load_ext sql

In [10]:
from sqlalchemy import create_engine, MetaData, Table

*Note: we have to prepend a Jupyter notebook cell with `%%sql` in order to run a SQL query. Place your code in the '# Your code here' lines. If you experience trouble connecting to the .db file, please ensure that you have the `pymysql` and `ipython-sql` packages installed. Also ensure that `sqlalchemy` is pinned at a version <2.*


Based on that data, answer the following questions:


### Question 11
What is the code you can use to connect to the TMBD database that is saved in the same location with the Jupyter notebook?

In [5]:
%sql sqlite:///ALX_DS_Integrated_FInal_exam_data/ALX_DS_Integrated_FInal_exam_data/Exam_data_part_1/TMDB.db

In [7]:
%%sql
select * from Movies
limit 2;

 * sqlite:///ALX_DS_Integrated_FInal_exam_data/ALX_DS_Integrated_FInal_exam_data/Exam_data_part_1/TMDB.db
Done.

[(5, 'Four Rooms', '1995-12-09 00:00:00.000000', 4000000, None, 'en', 'Four Rooms', "It's Ted the Bellhop's first night on the job...and the hotel's very unusual guests are about to place him in some outrageous predicaments. It seems that this evening's room service is serving up one unbelievable happening after another.", 22.87623, 4300000.0, 98.0, 'Released', "Twelve outrageous guests. Four scandalous requests. And one lone bellhop, in his first day on the job, who's in for the wildest New year's Eve of his life.", 6.5, 530),
 (11, 'Star Wars', '1977-05-25 00:00:00.000000', 11000000, 'http://www.starwars.com/films/star-wars-episode-iv-a-new-hope', 'en', 'Star Wars', 'Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker a ... (14 characters truncated) ... tain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.', 126.393695, 775398007.0, 121.0, 'Released', 'A long time ago in a galaxy far, far away...', 8.1, 6624)]

### Question 12
What is the primary key for the table “movies”?

In [12]:
from sqlalchemy import create_engine, MetaData, Table

In [13]:
# Reflect the languages table
languages_table = Table('languagemap', metadata, autoload_with=engine)
print(f"Foreign keys in 'languages': {[fk.parent.name for fk in languages_table.foreign_keys]}")

# Reflect the movies table
movies_table = Table('Movies', metadata, autoload_with=engine)
print(f"Foreign keys in 'movies': {[fk.parent.name for fk in movies_table.foreign_keys]}")

NameError: name 'metadata' is not defined

### Question 13
How many foreign keys does the “languagemap” table have?

### Question 14
What code would you use to set up a view of all movies that did not get released?

In [14]:
%%sql 

CREATE VIEW Not_Released AS
SELECT * FROM movies
WHERE release_status != 'Released'

 * sqlite:///ALX_DS_Integrated_FInal_exam_data/ALX_DS_Integrated_FInal_exam_data/Exam_data_part_1/TMDB.db
(sqlite3.OperationalError) view Not_Released already exists
[SQL: CREATE VIEW Not_Released AS
SELECT * FROM movies
WHERE release_status != 'Released']
(Background on this error at: https://sqlalche.me/e/20/e3q8)

### Question 15
How would you select only the title, release date, and release status columns from the view you created in the previous question?

In [16]:
%%sql 
select title, release_date, release_status
from Not_Released;

 * sqlite:///ALX_DS_Integrated_FInal_exam_data/ALX_DS_Integrated_FInal_exam_data/Exam_data_part_1/TMDB.db
Done.

[('Little Big Top', '2006-01-01 00:00:00.000000', 'Rumored'),
 ('The Helix... Loaded', '2005-01-01 00:00:00.000000', 'Rumored'),
 ('Higher Ground', '2011-08-26 00:00:00.000000', 'Post Production'),
 ('Crying with Laughter', '2009-06-01 00:00:00.000000', 'Rumored'),
 ('The Harvest (La Cosecha)', '2011-07-29 00:00:00.000000', 'Rumored'),
 ('The Naked Ape', '2006-09-16 00:00:00.000000', 'Rumored'),
 ('Brotherly Love', '2015-04-24 00:00:00.000000', 'Post Production'),
 ("Dancin' It's On", '2015-10-16 00:00:00.000000', 'Post Production')]

### Question 16
How many movies are no longer using their original titles?

In [20]:
%%sql 
select count(*) from movies
where title != original_title;

 * sqlite:///ALX_DS_Integrated_FInal_exam_data/ALX_DS_Integrated_FInal_exam_data/Exam_data_part_1/TMDB.db
Done.

[(261,)]

### Question 17
What is the most popular movie that was made after 01/01/2000 with a budget of more than $100 000 000? (Hint: Use the popularity field in the Movies table. Larger numbers are more popular.)

In [21]:
%%sql 
SELECT * 
FROM movies 
WHERE release_date > '2000-01-01' 
  AND budget > 100000000 
ORDER BY popularity DESC 
LIMIT 1;

 * sqlite:///ALX_DS_Integrated_FInal_exam_data/ALX_DS_Integrated_FInal_exam_data/Exam_data_part_1/TMDB.db
Done.

[(157336, 'Interstellar', '2014-11-05 00:00:00.000000', 165000000, 'http://www.interstellarmovie.net/', 'en', 'Interstellar', 'Interstellar chronicles the adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.', 724.247784, 675120017.0, 169.0, 'Released', 'Mankind was born on Earth. It was never meant to die here.', 8.1, 10867)]

### Question 18
How many movies are there that do not have English as their original language?

In [22]:
%%sql 
SELECT COUNT(*) FROM movies
WHERE original_language != 'en';

 * sqlite:///ALX_DS_Integrated_FInal_exam_data/ALX_DS_Integrated_FInal_exam_data/Exam_data_part_1/TMDB.db
Done.

[(298,)]

### Question 19
How many movies in the database were produced by Pixar Animation Studios?

In [23]:
%%sql 
SELECT COUNT(*) AS number_of_pixar_movies
FROM Movies m
JOIN ProductionCompanyMap p on m.movie_id = p.movie_id
JOIN ProductionCompanies pc on p.production_company_id = pc.production_company_id
WHERE pc.production_company_name = 'Pixar Animation Studios';

 * sqlite:///ALX_DS_Integrated_FInal_exam_data/ALX_DS_Integrated_FInal_exam_data/Exam_data_part_1/TMDB.db
Done.

[(16,)]

### Question 20
How many movies are in the database that are both a Romance and a Comedy?

In [ ]:
%%sql 
# Your code here

### Question 21
What is the most popular action movie that has some German in it? (Hint: The German word for German is Deutsch)

In [ ]:
%%sql 
# Your code here

### Question 22
In how many movies did Tom Cruise portray the character Ethan Hunt?

In [ ]:
%%sql 
# Your code here

### Question 23 
How many times was the actress Cate Blanchett nominated for an Oscar?

In [ ]:
%%sql 
# Your code here

### Question 24
How many movies contain at least one of the official South African Languages, Afrikaans or Zulu?

In [ ]:
%%sql 
# Your code here

### Question 25
Which of the movies mentioned above is the most popular?

In [ ]:
%%sql 
# Your code here

### Question 26
What would be the code to change the name of the language with the ‘zh’ iso code in the “language” table to ‘Chinese’?

In [ ]:
%%sql 
# Your code here

### Question 27
What would be the code to insert a new genre called ‘Sport’ with an id of 10?

In [ ]:
%%sql 
# Your code here

### Question 28 
You have just watched The Flintstones movie and did not find it very funny. What code would delete the entry that links The Flintstones to the Comedy genre?

In [ ]:
%%sql 
# Your code here

### Question 29
What code will give the 10 most recently released movies in the database?

In [ ]:
%%sql 
# Your code here

### Question 30
What code would you use to add a column to the language table that could be used for the English names of the different languages?

In [ ]:
%%sql 
# Your code here